#include "robomaster_cartridge.h"
#define CAP	TIM_CHANNEL_1//控制盖子的舵机
#define CAMERA TIM_CHANNEL_2//控制图传的舵机
#define OPEN_PWM 1200		//弹舱打开pwm
#define CLOSE_PWM 2200	//弹舱关闭pwm
#define DETECT_PWM 1050 //检测弹药数量的pwm
#define RESET_PWM 1350	//复位图传位置
/**********************************************************************************************************
*函 数 名: open_cap
*功能说明: 打开弹仓
*形    参: 
*返 回 值: 
**********************************************************************************************************/
void open_cap()
{
	PWM_SetDuty(&htim5,CAP,OPEN_PWM);
}
/**********************************************************************************************************
*函 数 名: close_cap
*功能说明: 关闭弹仓
*形    参: 
*返 回 值: 
**********************************************************************************************************/
void close_cap()
{
	PWM_SetDuty(&htim5,CAP,CLOSE_PWM);
}
/**********************************************************************************************************
*函 数 名: detect_cartridge
*功能说明: 检测弹药数量
*形    参: 
*返 回 值: 
**********************************************************************************************************/
void detect_cartridge()
{
	open_cap();
	PWM_SetDuty(&htim5,CAMERA,DETECT_PWM);
}
/**********************************************************************************************************
*函 数 名: reset_camera
*功能说明: 复位图传位置
*形    参: 
*返 回 值: 
**********************************************************************************************************/
void reset_camera()
{
	close_cap();
	PWM_SetDuty(&htim5,CAMERA,RESET_PWM);
}


